import time
# 简谱对应的频率
frequency_dict = {
    0: 0, # 0Hz即不发出声音
    1: 261.63,
    2: 293.66,
    3: 329.63,
    4: 349.23,
    5: 392.00,
    6: 440.00,
    7: 493.88,
    9: 1, # 用于歌词结束时的句号
    15: 196,
    16: 220
}
# 《小星星》
star = [
    1, 1, 5, 5, 6, 6, 5,
    4, 4, 3, 3, 2, 2, 1,
    5, 5, 4, 4, 3, 3, 2,
    5, 5, 4, 4, 3, 3, 2,
    1, 1, 5, 5, 6, 6, 5,
    4, 4, 3, 3, 2, 2, 1,
]
# 《精卫》
jw = [
    1, 1, 1, 2, 1, 16, 1, 2, 0,
    2, 3, 5, 3, 3, 0,
    3, 5, 6, 5, 3, 0,
    2, 3, 5, 3, 3, 9
]
# 《当爱已成往事》
love = [
    15, 16, 1, 0,
    2, 1, 0,
    15, 16, 1, 1, 0,
    1, 2, 1, 9
]
text = "你与我,先谈养心殿,后拜瀑淋身,闲暇闻几页,臭读几篇书" # text用于存放歌词，类型为列表
# text = "为何你,不懂,只有有爱,就有痛"
list_lyric = [char for char in text if char != ','] # 将歌词切片，一个字作为一个元素。注意区分逗号的中英文格式！
def ring(fre, time):
    import winsound
    winsound.Beep(fre, time)
i = 0
for x in jw:
    y = frequency_dict[x]
    if y == 0:
        print(",")
        time.sleep(0.8)
    elif y == 1:
        print("。")
    else:
        print(list_lyric[i], end="")
        i += 1
        ring(int(2.5*y), 350) # 我电脑的扬声器将正常的频率乘以2.5后才听得清楚，使用者可以适当调整
